harold-bank/app/views/accounts/index.html.erb

      <%= f.label :account_number, 'Account Number' %><br>
      <%= f.select :account_number, options_from_collection_for_select(Account.all, :account_number, :account_number) %><br><br>
---
SELECT "accounts".* FROM "accounts"