harold-bank/app/views/accounts/new.html.erb

SELECT "users".* FROM "users"
---
    <%= f.label :user, 'User' %><br>
    <%= f.select :user_id, options_from_collection_for_select(User.all, :id, :email) %><br><br>