app/controllers/accounts_controller.rb

  def index
    authorize! :index, Account if current_user.admin?
    @accounts = Account.all
---
SELECT "accounts".* FROM "accounts"

  def create
    authorize! :create, Account if current_user.admin?
    @account = Account.new(account_params)

    if @account.save
---
INSERT INTO "accounts" ("user_id", "amount", "account_number", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["amount", 20.0], ["account_number", "KJ1YS"], ["active", true], ["created_at", "2019-05-17 14:36:56.409251"], ["updated_at", "2019-05-17 14:36:56.409251"]]