app/models/account.rb

UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", 234.0], ["updated_at", "2019-05-17 13:26:07.492548"], ["id", 6]]
---
  def deposit(amount)
    if amount >= 0.0
      self.amount += amount
      self.save!

UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", 22.0], ["updated_at", "2019-05-17 05:54:08.093725"], ["id", 2]]
UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", 30.0], ["updated_at", "2019-05-17 05:54:08.133556"], ["id", 1]]
---
  def transfer(destination, amount)
    destination_account = Account.by_account_number(destination)
    if destination_account
      if funds_available?(amount)
        self.amount -= amount
        self.save!
        destination_account.amount += amount
        destination_account.save!

UPDATE "accounts" SET "amount" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["amount", 1.0], ["updated_at", "2019-05-17 12:30:05.560417"], ["id", 6]]
---
  def withdraw(amount)
    if funds_available?(amount)
      self.amount -= amount
      self.save!