app/views/accounts/show.html.erb

      <%= f.label :account_number, 'Account Number' %><br>
      <%= f.select :account_number, options_from_collection_for_select(Account.all.select { |a| a.id != @account.id }, :account_number, :account_number) %>
---
SELECT "accounts".* FROM "accounts"